Autodesk.Revit.DB.ImageTypeStatus
Indicates the current state of the contents of the ImageType.
Since:
2021
Since:
2021

Autodesk.Revit.DB.ImageTypeStatus.Generated
The internally created image is available.

Autodesk.Revit.DB.ImageTypeStatus.Imported
The image was imported and is available.

Autodesk.Revit.DB.ImageTypeStatus.Unloaded
The linked images was unloaded by the user. No image is available.

Autodesk.Revit.DB.ImageTypeStatus.FailedToLoad
The linked image could not be loaded from file.
Some possible reasons are:
The file could not be foundThe file could be corrupt or not contain image dataIn case of PDF files, the file might be encrypted or not have the requested page

Autodesk.Revit.DB.ImageTypeStatus.Loaded
The linked image was successfully loaded.

Autodesk.Revit.DB.ImageTypeStatus.Unknown
The linked image has not yet been loaded. No image is available.
This status is only returned before the document is fully opened.